TiNredmc/Foculus_Rift_Tracker_STM32F3DISCOVERY/src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  YFL
 * @version V0.4
 * @date    11.5.2014
 * @brief   Main program body
 ******************************************************************************
 */

// The "Foculus Rift" tracker
//------------------------------------------------------------------
// A USB HID device, sending Accelerometer, Gyroscope and Magnetometer data over USB in an
// Oculus Rift compatible format.
// This project comes in useful, if you are building your own DIY Head Mounted Display.
// It solves the problem of finding a motion tracker.
// The firmware runs on the STM32F3DISCOVERY board and should be compatible with all Oculus Rift games.

// development blog:   http://yetifrisstlama.blogspot.fr/2014/03/the-foculus-rift-part-2-reverse.html

// Organization:
//------------------------------------------------------------------
// main.c   		main logic of the tracker,
//                  handling and reformating the sensor data stream and packing it into 62 byte packets to be sent over USB,
//                  Assign the coordinate system directions
//                  keeping track of the configuration data structures which the libOVR might send and request
// peripherals.c    setup and request data from the 3 sensor chips over SPI and I2C
//                  Handle the scaling and calibration factors, so the headtracker moves in the right way
//                  Zero-level calibration routine for the gyroscope
//                  Save calibration factors to flash
//                  PWM-patterns for the 8 status LEDs
// usb_desc.c       USB - HID descriptors, which fool the PC into thinking that there is an Oculus RIft corrected
// usb_endp.c       STM USB driver endpoint1 callbacks, just sets some global flags to inform the main routine when there is new data
// usb_prop.c       Customization of the STM USB driver, so feature reports can be sent and received
//                  received data is copied in the global array featureReportData[] and then processed by the main loop
// fonts.c          fonts for SSD1036 library
// ssd1306          library to send data to ssd1306 OLED display.send out from i2c number 2 port.


// Changelog
//--------------------------------
// 09.03.2014:	Fixed bug in handleConfigPacketEvent() by adding break; statements (data rate was always 1 ms before)
// 10.03.2014:  Changed wMaxPacketSize from 62 to 64
// 19.03.2014:  Changed I2C Bus speed to 400 kHz, which allows to read all 3 sensors in 0.65 ms  (before it was > 2 ms)
// 20.03.2014:  Now evaluating the "new data ready" pins of all 3 sensors (improves timing a lot, reduces jitter)
//              Enabled FIFO in Streaming mode of Accelerometer and Gyro (no samples will be lost!)
//              Fixed Glitches in Magnetometer output by setting it to 75 Hz measurement rate (was 220 Hz before)
// 23.03.2014:  Fixed a problem with the USB interrupt and atomic access, not allowing the tracker to change sensor scale
//				Changed sensor scaling to floating point numbers and scaled to values as expected from the SDK
// 29.03.2014:  Added gyroscope "set to zero" calibration routine (Press the user button on the STM board and keep it very still)
//				Added temperature readout from gyro
//				Added some nice LED animations for IDLE mode, Tracker running mode and Calibration mode
// 01.04.2014:	Gyro offset calibration is now saved to Flash at address 0x08006000 and hence retained after power off
// 08.05.2014:	Fixed bug in readSensorAcc(): an array was accessed outside its boundaries.
//				also included the .hex file and switched on compiler optimizations
// 11.05.2014:	Experimental: Setting of board orientation ...
//				Push the user button for > 1 s to choose between 8 preconfigured orientation settings
//				Push the user button again for > 1 s to save the setting to FLASH memory
// 27.04.2018   Added the OLED library .interface @ i2c number2 .OLED display .e-compass temperature and gyroscope data
// 02.05.2018   Changed Font from "Font_11x18" to "Font_7x10"
// 03.05.2018   Moved the OLED statement from "while(1)" to void main section.
// 04.05.2018   Removed the "Init..."(OLED statement).
//

#pragma pack(1)		//If this is not defined, GCC Will use padding bytes and mess up the union structs

/* Includes ------------------------------------------------------------------*/
#include "string.h"
#include "main.h"
#include "stm32f30x.h"
#include "stm32f3_discovery.h"
#include "globalVariables.h"
#include "peripherals.h"
#include "ssd1306.h"
#include "fonts.h"
/* Init global variables -----------------------------------------------------*/
RiftDisplayInfoFrameSep dataDisplayInfo;
RiftKeepAliveFrameSep dataKeepAlive;
RiftConfigFrameSep dataConfig;
RiftScaleFrameSep dataScale;
RiftSensorFrameSep dataToBeSent;
__IO uint8_t EP1flagTXcomplete = 1;
__IO uint8_t EP1flagRXcomplete = 0;
uint8_t orientationIndex=0;						//Holds the current orientation setting of the coordinate system (0-7)
												//This variable is saved to flash and restored on power up
												//Setup the corresponding orientations in packFoculusdataBlock()

/* Private variables ---------------------------------------------------------*/
RCC_ClocksTypeDef RCC_Clocks;
// Timer compare values are buffered locally and updated in the configFrame received event
uint32_t currentKeepAliveTimeout = 10000;		//[ms]
uint16_t currentDelayBetweenPackets = 100;		//[ms]
uint8_t  EP1debugBuffer[128];					//Not really used at the moment
int32_t gyroBuffer[3];							//[X,Y,Z] Will hold the scaled and ready to send sensor data
int32_t accBuffer[3];							//[X,Y,Z]
int16_t magBuffer[3];							//[X,Z,Y]
int16_t tempBuffer;								//Holds temperature as read from Magnetometer

/* Private function prototypes -----------------------------------------------*/
void initDefaultRiftSettings();
void packFoculusdataBlock();
void packSensorDataBlock(int32_t Xin, int32_t Yin, int32_t Zin, uint8_t *sensorDataOut);
void handleConfigPacketEvent();

enum FoculusStates {
    FocSt_Init,			// Pause sending data (keep alive timeout for example)
    FocSt_SendData		// Send data
};
