TiNredmc/Foculus_Rift_Tracker_STM32F3DISCOVERY/src/main.c
uint8_t focState = FocSt_Init;


//Implement the user interface in one big ugly blocking function.
//I'm fully aware that this does stall the USB communications, which might cause trouble!
void handleButton(){
	uint8_t i;
	LED_out_byte( 0x00 );						//See how long ...
	i = getShortLongButtonPress();
	if( i==1 ){									//Short button press
		for (i=0; i<=5; i++){					//Blink LEDs 5 times to indicate gyro bias calibration
			delayms( 100 );
			LED_out_byte( 0xFF );
			delayms( 100 );
			LED_out_byte( 0x00 );
		}
		doGyroBiasCalibration();				//Start calibration measurement
	} else if( i==2 ){							//Long button press, do selection of orientation
		STM_EVAL_LEDOn( orientationIndex );
		while( STM_EVAL_PBGetState( BUTTON_USER ) ); //Wait for button release
		while( 1 ){
			STM_EVAL_LEDOn( orientationIndex );	//Indicate current orientation index
			i = getShortLongButtonPress();
			if( i==1 ){							//If short press, increment orientation index
				orientationIndex++;
				if( orientationIndex >= 8 ){
					orientationIndex = 0;
				}
				LED_out_byte( 0x00 );
			} else if ( i==2 ){					//If long press, save and exit orientation mode
				saveCalibrationToFlash();		//Experimental and potentially dangerous: save calibration values and orientation to FLASH memory
				for (i=0; i<=5; i++){			//Blink LEDs 5 times to indicate save
					delayms( 100 );
					STM_EVAL_LEDOn( orientationIndex );
					delayms( 100 );
					LED_out_byte( 0x00 );
				}
				break;
			}
		}
	}
}

/**
 * @brief  Main program.
 * @param  None
 * @retval None
 */
int main(void) {
	
		
		
		
		
	uint8_t i;	//Generic for loop counter variable
	/* Setup SysTick event each 1 ms */
	RCC_GetClocksFreq( &RCC_Clocks );
	SysTick_Config( RCC_Clocks.HCLK_Frequency / 1000 );	  //Every 1 ms

	/* Configure the USB (will get stuck here until USB is plugged in)*/
	USB_Config();

	/* Init peripherals */
	LED_Config();
	initDefaultRiftSettings();
	initSensorGyro( dataScale.rFrame.gScale );
	initSensorAccMag( dataScale.rFrame.aScale, dataScale.rFrame.mScale );	// Init combined accelerometer and magnetometer chip

	/* Infinite loop */
	while (1) {
//---------------------------------------------------------------------------------------------------------
//		Is the reception of a new packet on Endpoint 1 (EP1) finished? This is not used at the moment.
//---------------------------------------------------------------------------------------------------------
		if ( EP1flagRXcomplete ) {
			USB_SIL_Read( EP1_OUT, EP1debugBuffer );
			SetEPRxValid( ENDP1 );
			EP1flagRXcomplete = 0;
//			uint8_t command = EP1debugBuffer[0];
		}
//----------------------------------------------------------------------------------------------------
//		Check if some settings have been updated by the USB interrupt and fire an event to handle the setting change
//----------------------------------------------------------------------------------------------------
		if ( newConfigFrameReceived >= 0 ){
			if ( newConfigFrameReceived == featureReportData[0] ){	//Rudimentary check if featureReportData contains valid data (it does not always and I don't understand why)
				handleConfigPacketEvent();
			} else {
				newConfigFrameReceived = -1;						//Sometimes a glitch happens and no new data is written to featureReportData
			}
		}
//----------------------------------------------------------------------------------------------------
//		Check if user pushed the button to change the settings
//----------------------------------------------------------------------------------------------------
		if ( STM_EVAL_PBGetState( BUTTON_USER ) ){	//Check if button is pressed
			handleButton();							//ToDo: !!! Danger !!! This is blocking and will stall USB communications!
		}
//----------------------------------------------------------------------------------------------------
//		Handle sensor data statemachine
//----------------------------------------------------------------------------------------------------
		switch ( focState ){
		case FocSt_Init:									// Do not send sensor data while in init state, wait for keepALive packet
			LED_ani_idle();
			break;
		case FocSt_SendData:
			LED_ani_run();
			if ( isGyroNewData() ){
				tempBuffer = readSensorGyro( gyroBuffer );	//takes 0.05 ms, wow, SPI, such fast!
			}
			if ( isAccNewData() ){
				readSensorAcc( accBuffer );					//takes 0.23 ms
			}
			if ( isMagNewData() ){
				readSensorMag( magBuffer );					//takes 0.37 ms
			}
			// Check if a new packet shall be sent over USB
			// Do this only if: _last transmission finished_  and if _enough time passed_
			if ( EP1flagTXcomplete && (timerTimeSinceLastFrameSent >= currentDelayBetweenPackets) ) {
				EP1flagTXcomplete = 0;			//Yep, start new USB transmission ...
				timerTimeSinceLastFrameSent = 0;
				packFoculusdataBlock();			//Format the data from sensors as a SensorFrame
				USB_SIL_Write( EP1_IN, dataToBeSent.rawUSBdata, 62 );	//Hand data over to the USB driver
				SetEPTxValid( ENDP1 );
			}
			//  * SKD sends keep alive packets every 3 seconds or so, they contain keepALiveIntervalMs
			//	  this is a (10 s) timeout, if this time has passed and no keep alive packet received, then
			//    stop sending sensor data.
			// Check if a keepAlive timout occurred
			if ( timerTimeSinceLastKeepAlive > currentKeepAliveTimeout ){
				focState = FocSt_Init;			//Timeout occurred, back to init state
			}
			break;
		}
		
	} // end loop
	ssd1306_Init();
	    delayms( 100 );
	    ssd1306_SetCursor(0,0);//set cursor to x=0 y=0
	   	ssd1306_WriteString("Temp=",Font_7x10,White);//Temp=
	    ssd1306_SetCursor(5,0);//set cursor to x=5 y=0
	    ssd1306_WriteString(tempBuffer,Font_7x10,White); //Temp=tempBuffer value
	    ssd1306_SetCursor(0,1);//set cursor to x=0 y=1
	    ssd1306_WriteString("GyroX=",Font_7x10,White);//GyroX=
	    ssd1306_SetCursor(6,1);//set cursor to x=6 y=1
	    ssd1306_WriteString(gyroBuffer[0],Font_7x10,White);//show gyro data I think its "x axis"
	    ssd1306_SetCursor(0,2);//set cursor to x=0 y=2
	    ssd1306_WriteString("GyroY=",Font_7x10,White);//GyroY=
	    ssd1306_SetCursor(6,2);//set cursor to x=6 y=2
	    ssd1306_WriteString(gyroBuffer[1],Font_7x10,White);//show gyro data I think its "y axis"
	    ssd1306_SetCursor(0,3);//set cursor x=0 y=3
	    ssd1306_WriteString("GyroZ=",Font_7x10,White);//GyroZ=
	    ssd1306_SetCursor(6,3);//set cursor x=6 y=3
	    ssd1306_WriteString(gyroBuffer[2],Font_7x10,White);//show gyro data I think its "z axis"
	    ssd1306_UpdateScreen();
}//for void main

// Copy data form the memory buffer used by the USB interrupt
// to the structs used by the main routine, which are useful for decoding purposes
// It is a bit tricky to access data from an interrupt routine, as it can change anytime!
void memcpy_atomic(uint8_t *to, __IO uint8_t *from, size_t size){
	size_t counter;
	for (counter=0; counter<size; counter++){
		*to = *from;
		to++;
		from++;
	}
//	memcpy(to, from, size);		//Not sure if the above (using volatile) is any better (or even worse) than this
}

void handleConfigPacketEvent(){
// This is called, after a new ConfigPacket has been received from the libOVR.
// At this point, the new configuration data needs to be copied in the relevant struct
// Then we react accordingly to the updated configuration
	uint16_t command;
	switch ( newConfigFrameReceived ){
	case Packet_KeepAlive:		//		Reset keepAlive Counter, set state to Run
		memcpy_atomic( dataKeepAlive.rawUSBdata, featureReportData, 5 );
		newConfigFrameReceived = -1;
		if ( dataKeepAlive.rFrame.keepAliveIntervalMs > 100 ){
			currentKeepAliveTimeout = dataKeepAlive.rFrame.keepAliveIntervalMs;
		}
		if ( focState==FocSt_Init ){
			focState = FocSt_SendData;
		}
		command = dataKeepAlive.rFrame.commandID;
		break;
	case Packet_Config:			//		Reset packet interval, keep ALive Interval and handle Flags
		memcpy_atomic( dataConfig.rawUSBdata, featureReportData, 7 );
		newConfigFrameReceived = -1;
		currentDelayBetweenPackets = dataConfig.rFrame.packetInterval;
		if ( dataConfig.rFrame.keepAliveIntervalMs > 100 ){
			currentKeepAliveTimeout = dataConfig.rFrame.keepAliveIntervalMs;
		}
		command = dataConfig.rFrame.commandID;
		break;
	case Packet_DisplayInfo:	//		Note, that at the moment this allows write access to the DisplayInfo data
		memcpy_atomic( dataDisplayInfo.rawUSBdata, featureReportData, 56 );
		newConfigFrameReceived = -1;
		command = dataDisplayInfo.rFrame.commandID;
		break;
	case Packet_Scale:			//		Reset Sensor chips and scaling factors to new scale
		memcpy_atomic( dataScale.rawUSBdata, featureReportData, 8 );
		newConfigFrameReceived = -1;
		initSensorGyro( dataScale.rFrame.gScale );
		initSensorAccMag( dataScale.rFrame.aScale, dataScale.rFrame.mScale );
		command = dataScale.rFrame.commandID;
		break;
	default:
		newConfigFrameReceived = -1;
	}
	timerTimeSinceLastKeepAlive = 0;
}

/**
 * @brief  Configure the USB.
 */
void USB_Config(void) {
	Set_System();
	Set_USBClock();
	USB_Interrupts_Config();
	USB_Init();
	while (bDeviceState != CONFIGURED) {
	}
}

//The SDK will request some configuration data from the tracker, here I set the default setting
//I tried to find sensible default settings, but especially for the displayInfo struct I'm not so sure if they are OK.
void initDefaultRiftSettings() {
	dataConfig.rFrame.commandID = 0;
	dataConfig.rFrame.flags = Flag_RawMode | Flag_SensorCoordinates;
	dataConfig.rFrame.keepAliveIntervalMs = currentKeepAliveTimeout;
	dataConfig.rFrame.packetInterval = currentDelayBetweenPackets;
	dataConfig.rFrame.two = 0x02;

	dataScale.rFrame.commandID = 0;
	dataScale.rFrame.aScale = 8;
	dataScale.rFrame.gScale = 1000;
	dataScale.rFrame.mScale = 2500;
	dataScale.rFrame.four = 0x04;

	dataKeepAlive.rFrame.commandID = 0;
	dataKeepAlive.rFrame.keepAliveIntervalMs = currentKeepAliveTimeout;
	dataKeepAlive.rFrame.eight = 0x08;

	dataDisplayInfo.rFrame.commandID = 0;
	dataDisplayInfo.rFrame.distortionType =  0x00;		//ToDo: Distortion Type Flags, What is possible here?
	dataDisplayInfo.rFrame.HResolution = 	 1280;
	dataDisplayInfo.rFrame.VResolution = 	  800;
	dataDisplayInfo.rFrame.HScreenSize =   149760;		//[um] ?
	dataDisplayInfo.rFrame.VScreenSize =  	93600;		//[um] ?
	dataDisplayInfo.rFrame.VCenter = 		46900;		//[um] ?
	dataDisplayInfo.rFrame.LensSeparation = 64000;		//[um] ?
	dataDisplayInfo.rFrame.eye2ScreenDistanceL = 41000; //[um] ?
	dataDisplayInfo.rFrame.eye2ScreenDistanceR = 41000; //[um] ?
	dataDisplayInfo.rFrame.k0 = 1.00;
	dataDisplayInfo.rFrame.k1 = 0.22;
	dataDisplayInfo.rFrame.k2 = 0.24;
	dataDisplayInfo.rFrame.k3 = 0.00;
	dataDisplayInfo.rFrame.k4 = 0.00;
	dataDisplayInfo.rFrame.k5 = 0.00;
	dataDisplayInfo.rFrame.nine = 0x09;

