TiNredmc/Foculus_Rift_Tracker_STM32F3DISCOVERY/src/main.c
	dataToBeSent.rFrame.messageType = TrackerMessage_Sensors;	//This means we send sensor data
	dataToBeSent.rFrame.sampleCount = 0;
	dataToBeSent.rFrame.timeStamp = 0;
	dataToBeSent.rFrame.commandID = 0;
	dataToBeSent.rFrame.temp = 4711;
	dataToBeSent.rFrame.mX = 4;
	dataToBeSent.rFrame.mY = 5;
	dataToBeSent.rFrame.mZ = 6;

	restoreCalibrationFromFlash();						//Restore gyro offset calibration factors once at startup from flash
}

//**********************************************************************************
//* Functions for fetching data from the Sensors and formating them in RIFT format *
//**********************************************************************************
void packSensorDataBlock( int32_t Xin, int32_t Yin, int32_t Zin, uint8_t *sensorDataOut ) {
/*
 * Within the readSensor() functions:
 *  the 16 bit int sensor values from the Gyro and Acc are scaled to physical units and cast to int32_t
 * Here:
 *  The first 21 LSB bits are used in this routine and reformated to fit in the dataBlock as expected by the Oculus SDK
 *  21 bit effective input range:     -1 048 576 (0x100000)   ...    -1 (0x1FFFFF)   ...    +1 048 575  (0x0FFFFF)
 */
	//Arrange the bits in the right order within the buffer
	sensorDataOut[0] = (Xin >> 13) & 0xFF;							//Xin[13:20]  (bit index 13 - 20 of Xin)
	sensorDataOut[1] = (Xin >>  5) & 0xFF;							//Xin[5:12]
	sensorDataOut[2] = ((Xin & 0x1F) << 3) | ((Yin >> 18) & 0x07);	//Xin[0:4],Yin[18:20] (MSB, part of Xin, part of Yin, LSB)

	sensorDataOut[3] = (Yin >> 10) & 0xFF;							//Yin[10:17]
	sensorDataOut[4] = (Yin >>  2) & 0xFF;							//Yin[2:9]
	sensorDataOut[5] = ((Yin & 0x03) << 6) | ((Zin >> 15) & 0x3F);	//Yin[0:1],Zin[15:20]

	sensorDataOut[6] = (Zin >>  7) & 0xFF;							//Zin[7:14]
	sensorDataOut[7] = (Zin <<  1) & 0xFE;							//Zin[0:6],0
}

void packFoculusdataBlock() {
//	Here we do the transformation from the two different sensor coordinate systems
//	to the libOVR coordinate system. We also allow 8 different mounting orientations
//	of the STM discovery board.
//  If the coordinate axes seem not right, here is the place to change it
	static uint16_t timeStamp = 0;
	dataToBeSent.rFrame.temp = tempBuffer;																		//Temperature
	dataToBeSent.rFrame.commandID = 0;
	dataToBeSent.rFrame.sampleCount = 1;
	dataToBeSent.rFrame.timeStamp = timeStamp++;
	switch( orientationIndex ){		//This allows the sensor board to be mounted in 8 different orientations (configurable by the Userbutton)
	default:
	case 0:	// These settings seem to fit for mounting the discovery board on the back of the HMD,
			// so that the LEDs point toward the face and the USB connectors point downwards
			// See also: riftCoord.png
		dataToBeSent.rFrame.mX = -magBuffer[ cmY ];
		dataToBeSent.rFrame.mY =  magBuffer[ cmX ];
		dataToBeSent.rFrame.mZ =  magBuffer[ cmZ ];
		packSensorDataBlock(  -accBuffer[ caY ],  accBuffer[ caX ],  accBuffer[ caZ ], dataToBeSent.rFrame.sensorData1 );		//Conv. Acc. data to Oculus format
		packSensorDataBlock(  -gyroBuffer[ cgX ], -gyroBuffer[ cgY ], gyroBuffer[ cgZ ], dataToBeSent.rFrame.sensorData1+8 );	//Conv. Gyro. data to Oculus format
		break;
	case 1:
		dataToBeSent.rFrame.mX = -magBuffer[ cmX ];
		dataToBeSent.rFrame.mY =  magBuffer[ cmY ];
		dataToBeSent.rFrame.mZ = -magBuffer[ cmZ ];
		packSensorDataBlock(  -accBuffer[ caX ],  accBuffer[ caY ],  -accBuffer[ caZ ], dataToBeSent.rFrame.sensorData1 );		//Conv. Acc. data to Oculus format
		packSensorDataBlock(  gyroBuffer[ cgY ], gyroBuffer[ cgX ], -gyroBuffer[ cgZ ], dataToBeSent.rFrame.sensorData1+8 );	//Conv. Gyro. data to Oculus format
		break;
	case 2:
		dataToBeSent.rFrame.mX =  magBuffer[ cmY ];
		dataToBeSent.rFrame.mY =  magBuffer[ cmX ];
		dataToBeSent.rFrame.mZ = -magBuffer[ cmZ ];
		packSensorDataBlock(  accBuffer[ caY ],  accBuffer[ caX ],  -accBuffer[ caZ ], dataToBeSent.rFrame.sensorData1 );		//Conv. Acc. data to Oculus format
		packSensorDataBlock(  gyroBuffer[ cgX ], -gyroBuffer[ cgY ], -gyroBuffer[ cgZ ], dataToBeSent.rFrame.sensorData1+8 );	//Conv. Gyro. data to Oculus format
		break;
	case 3:
		dataToBeSent.rFrame.mX = -magBuffer[ cmY ];
		dataToBeSent.rFrame.mY = -magBuffer[ cmX ];
		dataToBeSent.rFrame.mZ = -magBuffer[ cmZ ];
		packSensorDataBlock(  -accBuffer[ caY ],  -accBuffer[ caX ],  -accBuffer[ caZ ], dataToBeSent.rFrame.sensorData1 );		//Conv. Acc. data to Oculus format
		packSensorDataBlock(  -gyroBuffer[ cgX ], gyroBuffer[ cgY ], -gyroBuffer[ cgZ ], dataToBeSent.rFrame.sensorData1+8 );	//Conv. Gyro. data to Oculus format
		break;
	case 4:
		dataToBeSent.rFrame.mX = -magBuffer[ cmY ];
		dataToBeSent.rFrame.mY =  magBuffer[ cmZ ];
		dataToBeSent.rFrame.mZ = -magBuffer[ cmX ];
		packSensorDataBlock(  -accBuffer[ caY ],  accBuffer[ caZ ],  -accBuffer[ caX ], dataToBeSent.rFrame.sensorData1 );		//Conv. Acc. data to Oculus format
		packSensorDataBlock(  -gyroBuffer[ cgX ], gyroBuffer[ cgZ ], gyroBuffer[ cgY ], dataToBeSent.rFrame.sensorData1+8 );	//Conv. Gyro. data to Oculus format
		break;
	case 5:
		dataToBeSent.rFrame.mX = magBuffer[ cmY ];
		dataToBeSent.rFrame.mY = magBuffer[ cmZ ];
		dataToBeSent.rFrame.mZ = magBuffer[ cmX ];
		packSensorDataBlock(  accBuffer[ caY ],  accBuffer[ caZ ],  accBuffer[ caX ], dataToBeSent.rFrame.sensorData1 );		//Conv. Acc. data to Oculus format
		packSensorDataBlock(  gyroBuffer[ cgX ], gyroBuffer[ cgZ ], -gyroBuffer[ cgY ], dataToBeSent.rFrame.sensorData1+8 );	//Conv. Gyro. data to Oculus format
		break;
	case 6:
		dataToBeSent.rFrame.mX = -magBuffer[ cmX ];
		dataToBeSent.rFrame.mY =  magBuffer[ cmZ ];
		dataToBeSent.rFrame.mZ =  magBuffer[ cmY ];
		packSensorDataBlock(  -accBuffer[ caX ],  accBuffer[ caZ ],  accBuffer[ caY ], dataToBeSent.rFrame.sensorData1 );		//Conv. Acc. data to Oculus format
		packSensorDataBlock(  gyroBuffer[ cgY ], gyroBuffer[ cgZ ], gyroBuffer[ cgX ], dataToBeSent.rFrame.sensorData1+8 );	//Conv. Gyro. data to Oculus format
		break;
	case 7:
		dataToBeSent.rFrame.mX =  magBuffer[ cmX ];
		dataToBeSent.rFrame.mY =  magBuffer[ cmZ ];
		dataToBeSent.rFrame.mZ = -magBuffer[ cmY ];
		packSensorDataBlock(  accBuffer[ caX ],  accBuffer[ caZ ],  -accBuffer[ caY ], dataToBeSent.rFrame.sensorData1 );		//Conv. Acc. data to Oculus format
		packSensorDataBlock(  -gyroBuffer[ cgY ], gyroBuffer[ cgZ ], -gyroBuffer[ cgX ], dataToBeSent.rFrame.sensorData1+8 );	//Conv. Gyro. data to Oculus format
		break;
	}
}

/**
 * @brief  Basic management of the timeout situation.
 * @param  None.
 * @retval None.
 */

#ifdef  USE_FULL_ASSERT

/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* User can add his own implementation to report the file name and line number,
	 ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

	/* Infinite loop */
	while (1)
	{
	}
}
#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
